app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "upc", "available_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "P2"], ["upc", "2134567890"], ["available_on", "2019-07-13 17:54:00"], ["created_at", "2019-07-08 17:55:12.664128"], ["updated_at", "2019-07-08 17:55:12.664128"]]