app/models/product_property.rb

INSERT INTO "properties" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "airmax"], ["created_at", "2019-07-08 17:55:12.659802"], ["updated_at", "2019-07-08 17:55:12.659802"]]
SELECT  "properties".* FROM "properties" WHERE "properties"."name" = ? LIMIT ?  [["name", "airmax"], ["LIMIT", 1]]
---
  def property_attributes=(attributes)
    self.property = Property.find_or_create_by(name: attributes[:name])