app/views/products/show.html.erb

<p><strong>Properties:</strong></p>
<% @product.product_properties.each do |product_property| %>
---
SELECT "product_properties".* FROM "product_properties" WHERE "product_properties"."product_id" = ?  [["product_id", 2]]